balazsgrill/modembed/res/Devices/16xxxx/PIC16F1934.PIC
      <edc:DCRDef edc:access="--nn-nnn--nn--nn" edc:cname="CONFIG2" edc:default="0xffff" edc:desc="" edc:impl="0x3733" edc:name="CONFIG2" edc:nzwidth="0x10" edc:unimplval="1" edc:unused="0" edc:useinchecksum="0x3733">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="WRT" edc:desc="Flash Memory Self-Write Protection" edc:mask="0x3" edc:name="WRT" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Write protection off" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="BOOT" edc:desc="000h to 1FFh write protected, 200h to FFFh may be modified by EECON control" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="HALF" edc:desc="000h to 7FFh write protected, 800h to FFFh may be modified by EECON control" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ALL" edc:desc="000h to FFFh write protected, no addresses may be modified by EECON control" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:DCRFieldDef edc:cname="VCAPEN" edc:desc="Voltage Regulator Capacitor Enable" edc:mask="0x3" edc:name="VCAPEN" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="All VCAP pin functionality is disabled" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="RA6" edc:desc="VCAP functionality is enabled on RA6" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="RA5" edc:desc="VCAP functionality is enabled on RA5" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="RA0" edc:desc="VCAP functionality is enabled on RA0" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="PLLEN" edc:desc="PLL Enable" edc:mask="0x1" edc:name="PLLEN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="4x PLL enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="4x PLL disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="STVREN" edc:desc="Stack Overflow/Underflow Reset Enable" edc:mask="0x1" edc:name="STVREN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Stack Overflow or Underflow will cause a Reset" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Stack Overflow or Underflow will not cause a Reset" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BORV" edc:desc="Brown-out Reset Voltage Selection" edc:mask="0x1" edc:name="BORV" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="LO" edc:desc="Brown-out Reset Voltage (Vbor), low trip point selected." edc:when="(field &amp; 0x1) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_BORV_19"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="HI" edc:desc="Brown-out Reset Voltage (Vbor), high trip point selected." edc:when="(field &amp; 0x1) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_BORV_25"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="DEBUG" edc:desc="In-Circuit Debugger Mode" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="DEBUG" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="In-Circuit Debugger disabled, ICSPCLK and ICSPDAT are general purpose I/O pins" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="In-Circuit Debugger enabled, ICSPCLK and ICSPDAT are dedicated to the debugger" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LVP" edc:desc="Low-Voltage Programming Enable" edc:mask="0x1" edc:name="LVP" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Low-voltage programming enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="High-voltage on MCLR/VPP must be used for programming" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
    <edc:EEDataSector edc:beginaddr="0xF000" edc:endaddr="0xF100" edc:issection="true" edc:regionid="eedata" edc:sectiondesc="Data EEPROM" edc:sectionname="DEEPROM"/>
    <edc:BACKBUGVectorSector edc:beginaddr="0x8004" edc:endaddr="0x8005" edc:regionid="debug"/>
  </edc:ProgramSpace>
  <edc:DataSpace edc:endaddr="0x1000">
    <edc:RegardlessOfMode>
      <edc:SFRDataSector edc:bank="0" edc:beginaddr="0x0" edc:endaddr="0x20" edc:regionid="sfr0">
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="INDF0" edc:desc="" edc:impl="0xff" edc:isindirect="true" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="INDF0" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INDF0" edc:desc="" edc:mask="0xff" edc:name="INDF0" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="INDF1" edc:desc="" edc:impl="0xff" edc:isindirect="true" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="INDF1" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INDF1" edc:desc="" edc:mask="0xff" edc:name="INDF1" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
